zhengwang721/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd2064g3.h
#define PIN_PA15H_PTC_X3                  15  /**< \brief PTC signal: X3 on PA15 mux H */
#define MUX_PA15H_PTC_X3                   7
#define PORT_PA15H_PTC_X3          (1u << 15)
#define PIN_PA16H_PTC_X4                  16  /**< \brief PTC signal: X4 on PA16 mux H */
#define MUX_PA16H_PTC_X4                   7
#define PORT_PA16H_PTC_X4          (1u << 16)
#define PIN_PA17H_PTC_X5                  17  /**< \brief PTC signal: X5 on PA17 mux H */
#define MUX_PA17H_PTC_X5                   7
#define PORT_PA17H_PTC_X5          (1u << 17)
#define PIN_PA18H_PTC_X6                  18  /**< \brief PTC signal: X6 on PA18 mux H */
#define MUX_PA18H_PTC_X6                   7
#define PORT_PA18H_PTC_X6          (1u << 18)
#define PIN_PA19H_PTC_X7                  19  /**< \brief PTC signal: X7 on PA19 mux H */
#define MUX_PA19H_PTC_X7                   7
#define PORT_PA19H_PTC_X7          (1u << 19)
#define PIN_PB20H_PTC_X8                  52  /**< \brief PTC signal: X8 on PB20 mux H */
#define MUX_PB20H_PTC_X8                   7
#define PORT_PB20H_PTC_X8          (1u << 20)
#define PIN_PB21H_PTC_X9                  53  /**< \brief PTC signal: X9 on PB21 mux H */
#define MUX_PB21H_PTC_X9                   7
#define PORT_PB21H_PTC_X9          (1u << 21)
#define PIN_PB22H_PTC_X10                 54  /**< \brief PTC signal: X10 on PB22 mux H */
#define MUX_PB22H_PTC_X10                  7
#define PORT_PB22H_PTC_X10         (1u << 22)
#define PIN_PB23H_PTC_X11                 55  /**< \brief PTC signal: X11 on PB23 mux H */
#define MUX_PB23H_PTC_X11                  7
#define PORT_PB23H_PTC_X11         (1u << 23)
#define PIN_PB24H_PTC_X12                 56  /**< \brief PTC signal: X12 on PB24 mux H */
#define MUX_PB24H_PTC_X12                  7
#define PORT_PB24H_PTC_X12         (1u << 24)
#define PIN_PB25H_PTC_X13                 57  /**< \brief PTC signal: X13 on PB25 mux H */
#define MUX_PB25H_PTC_X13                  7
#define PORT_PB25H_PTC_X13         (1u << 25)
#define PIN_PB26H_PTC_X14                 58  /**< \brief PTC signal: X14 on PB26 mux H */
#define MUX_PB26H_PTC_X14                  7
#define PORT_PB26H_PTC_X14         (1u << 26)
#define PIN_PB27H_PTC_X15                 59  /**< \brief PTC signal: X15 on PB27 mux H */
#define MUX_PB27H_PTC_X15                  7
#define PORT_PB27H_PTC_X15         (1u << 27)
#define PIN_PA00H_PTC_Y0                   0  /**< \brief PTC signal: Y0 on PA00 mux H */
#define MUX_PA00H_PTC_Y0                   7
#define PORT_PA00H_PTC_Y0          (1u <<  0)
#define PIN_PA01H_PTC_Y1                   1  /**< \brief PTC signal: Y1 on PA01 mux H */
#define MUX_PA01H_PTC_Y1                   7
#define PORT_PA01H_PTC_Y1          (1u <<  1)
#define PIN_PA02H_PTC_Y2                   2  /**< \brief PTC signal: Y2 on PA02 mux H */
#define MUX_PA02H_PTC_Y2                   7
#define PORT_PA02H_PTC_Y2          (1u <<  2)
#define PIN_PA03H_PTC_Y3                   3  /**< \brief PTC signal: Y3 on PA03 mux H */
#define MUX_PA03H_PTC_Y3                   7
#define PORT_PA03H_PTC_Y3          (1u <<  3)
#define PIN_PA04H_PTC_Y4                   4  /**< \brief PTC signal: Y4 on PA04 mux H */
#define MUX_PA04H_PTC_Y4                   7
#define PORT_PA04H_PTC_Y4          (1u <<  4)
#define PIN_PA05H_PTC_Y5                   5  /**< \brief PTC signal: Y5 on PA05 mux H */
#define MUX_PA05H_PTC_Y5                   7
#define PORT_PA05H_PTC_Y5          (1u <<  5)
#define PIN_PA06H_PTC_Y6                   6  /**< \brief PTC signal: Y6 on PA06 mux H */
#define MUX_PA06H_PTC_Y6                   7
#define PORT_PA06H_PTC_Y6          (1u <<  6)
#define PIN_PA07H_PTC_Y7                   7  /**< \brief PTC signal: Y7 on PA07 mux H */
#define MUX_PA07H_PTC_Y7                   7
#define PORT_PA07H_PTC_Y7          (1u <<  7)
#define PIN_PB00H_PTC_Y8                  32  /**< \brief PTC signal: Y8 on PB00 mux H */
#define MUX_PB00H_PTC_Y8                   7
#define PORT_PB00H_PTC_Y8          (1u <<  0)
#define PIN_PB01H_PTC_Y9                  33  /**< \brief PTC signal: Y9 on PB01 mux H */
#define MUX_PB01H_PTC_Y9                   7
#define PORT_PB01H_PTC_Y9          (1u <<  1)
#define PIN_PB02H_PTC_Y10                 34  /**< \brief PTC signal: Y10 on PB02 mux H */
#define MUX_PB02H_PTC_Y10                  7
#define PORT_PB02H_PTC_Y10         (1u <<  2)
#define PIN_PB03H_PTC_Y11                 35  /**< \brief PTC signal: Y11 on PB03 mux H */
#define MUX_PB03H_PTC_Y11                  7
#define PORT_PB03H_PTC_Y11         (1u <<  3)
#define PIN_PB04H_PTC_Y12                 36  /**< \brief PTC signal: Y12 on PB04 mux H */
#define MUX_PB04H_PTC_Y12                  7
#define PORT_PB04H_PTC_Y12         (1u <<  4)
#define PIN_PB05H_PTC_Y13                 37  /**< \brief PTC signal: Y13 on PB05 mux H */
#define MUX_PB05H_PTC_Y13                  7
#define PORT_PB05H_PTC_Y13         (1u <<  5)
#define PIN_PB06H_PTC_Y14                 38  /**< \brief PTC signal: Y14 on PB06 mux H */
#define MUX_PB06H_PTC_Y14                  7
#define PORT_PB06H_PTC_Y14         (1u <<  6)
#define PIN_PB07H_PTC_Y15                 39  /**< \brief PTC signal: Y15 on PB07 mux H */
#define MUX_PB07H_PTC_Y15                  7
#define PORT_PB07H_PTC_Y15         (1u <<  7)

#endif /* _SAMD2064G3_PIO_ */
